fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорыРеализации</name>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализации</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
//{{lg
// Массовое Создание документов реализации товаров и услуг
#Область ОбработчикиСобытийФормы 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Период.ДатаНачала = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	Объект.Период.ДатаОкончания = КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.ДоговорыРеализации.Очистить();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьДокументыРеализации(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
		Возврат;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен период создания документов");
	КонецЕсли;
	
	ДлительнаяОперация = СоздатьДокументыНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("ВыводитьСообщения", Истина);
	Оповещение = Новый ОписаниеОповещения("ПолучитьСписокДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция СоздатьДокументыНаСервере()												
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьСписокДокументовРеализацииТоваровИУслуг",
	Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
	
КонецФункции 

&НаКлиенте
Процедура ПолучитьСписокДокументов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Ошибка" Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
	Если Результат = Неопределено Тогда  // Пользователь отменил задание.
		ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка отменена пользователем");
		Возврат;	
	КонецЕсли;
			
	РезультатОбработки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Объект.ДоговорыРеализации.Очистить();
	Если РезультатОбработки.ДокументовСоздано = 0 И РезультатОбработки.ДокументовНеСоздано = 0 Тогда	
		ТекстСообщения = 
		"Для выбранного периода все документы Реализации товаров и услуг по абонентским договорам уже созданы";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	ЗаписатьСписокДокументов(РезультатОбработки.МассивДоговоровИРеализаций);
	ТекстСообщения = СтрШаблон("Для указанного периода количество успешно созданных документов - %1.
								|Количество не созданных документов по причине ошибок - %2. ", 	
								РезультатОбработки.ДокументовСоздано,РезультатОбработки.ДокументовНеСоздано);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСписокДокументов(МассивСписка); 
	
	Для Каждого ЭлементМассива Из МассивСписка Цикл 	
		СтрокаСписка = Объект.ДоговорыРеализации.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСписка, ЭлементМассива);
	КонецЦикла
КонецПроцедуры

#КонецОбласти




//lg}}
